Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་དེ་ཡང་མེད་པར་གྱུར་ན་ངས་སྨན་བཀྲུས་ཏེ་བོར་བ་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བའི་གསང་སྔགས་ཀྱི་གཞི་དག་གིས་བྲམས་ནས་ནད་པ་ལ་བྱིན་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ།
en: If those were not available either, I would infuse medicinal decoctions with the mantra formula of the peaceful core of knowledge and give it to those sick persons, and all their diseases would be completely cured.

source: །རིགས་ཀྱི་བུ་ངས་ཐབས་ལ་འཇུག་པའི་སྦྱོར་བ་ལ་བརྟུལ་བ་དེས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཡང་དག་པར་བསྒྲུབས་སོ།
en: Noble son, through my commitment to engaging in the application of such skillful means, I ripened sentient beings and accomplished unsurpassed and perfect awakening.

source: །གང་ན་ཤིང་ལྗོན་པ་དག་མེ་ཏོག་དང་འབྲས་བུ་མི་སྐྱེ་བ་དེར་ཡང་ངས་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་གསང་སྔགས་ཀྱི་གཞི་ཆེན་པོ་དག་གིས་ཆར་པའི་ཆུ་ལ་བྲམས་ནས་ཤིང་དག་ལ་བཏབ་ན་ཤིང་དེ་དག་ལོ་མང་པོར་ཆུ་མེད་ཀྱང་མེ་ཏོག་དང་འབྲས་བུ་དག་དང་ལྡན་པར་གྱུར་ཏོ།
en: “Noble son, in places where trees did not bear flowers or fruits, I would infuse rainwater with the mantra formula of the peaceful core of knowledge and sprinkle it on those trees. Many flowers and fruits would then grow on those trees for many years, even in the absence of any water.

source: །དེ་བཞིན་དུ་བུ་རམ་ཤིང་དང་། རྒུན་འབྲུ་དག་དང་། འབྲུ་དང་། སྨན་དག་གི་བར་དག་ལ་ཡང་བྱས་སོ།
en: I did the same with sugarcane plants, grapes, grains, and herbs.

source: །གང་ན་ཆར་མི་འབབ་ཅིང་ཆུ་མེད་པ་དེར་ཡང་ངས་རུ་སྦལ་གྱི་སྙིང་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་གསང་སྔགས་ཀྱི་གཞི་འདིས་བྲམས་ནས་ཤིང་ཙམ་པ་ཀའི་འདབ་མས་དཀྲིས་ཏེ།
en: In places affected by droughts, where no rain was falling, I would infuse tortoise heart with the mantra formula of the peaceful core of knowledge and wrap it with campaka leaves.

source: ཀླུ་མཚོའི་འགྲམ་དུ་བཞག་ན་ཆར་ཆེན་པོ་དང་། ཆུ་ཆེན་པོའི་ཚོགས་བྱུང་བར་གྱུར་ཏོ།
en: I would then place it on the shore of the ocean of the nāgas, and strong rains and great masses of water would pour down.

source: །དེར་ཆུ་ཆེན་པོ་བྱུང་བས་སེམས་ཅན་རྣམས་ཀྱི་ཁྱིམ་དང་། ཞིང་དང་། ཀུན་དགའ་ར་བའི་བར་ཆུད་ཟ་བར་གྱུར་ན་དེར་ཡང་ངས་སྦྲུལ་གྱི་རྒྱལ་པོའི་ནོར་བུ་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བའི་གསང་སྔགས་ཀྱི་གཞི་འདིས་བྲམས་ནས་ཀླུའི་གནས་སུ་བཞག་ན་ཆར་ཆུ་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ།
en: If the downpour of those strong rains damaged the houses, fields, and monastic compounds, I would then infuse a precious gem of the king of snakes with this mantra formula of the peaceful core of knowledge and place it in the abode of those nāgas, and the rains would then come to a halt.

source: །གང་ན་དུས་མ་ཡིན་པར་རླུང་དང་། ཉི་མ་དང་། དུས་མ་ཡིན་པའི་སྤྲིན་དང་། མུན་པ་དང་། རྡུལ་གྱི་ཆར་པ་དང་། གྲང་བ་དང་། དྲོ་བ་དང་། དུས་ཕྱིན་ཅི་ལོག་ཏུ་འབྱུང་བའི་བར་དང་། དམག་ཚོགས་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། གཟའ་དང་། རྒྱུ་སྐར་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་པ་དང་། དུས་ཚིགས་དང་། ལོ་རྣམས་ཡང་དག་པར་འབྱུང་བ་མ་ཡིན་པའི་བར་ལ་ངས་སྙིང་རྗེས་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་ཞག་བདུན་པ་གཅིག་གི་ཉིན་མཚན་དུ་ཁྲུས་བྱས་ནས་འོ་མ་དང་འབྲས་ཆན་གྱི་ཁ་ཟས་ཟ་ཞིང་ཚངས་པའི་གནས་པ་བསྒོམ་པ་ལ་མངོན་པར་དགའ་བས་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་འདི་ལས་གཞན་མི་བྱེད་པར་བརྗོད་དེ།
en: “In places affected by untimely wind, sun, untimely clouds, darkness, sandstorms, cold, heat, or untimely seasons, by armies, or by disturbances of the moon, the sun, the planets, the lunar mansions, the full moon, the half-moon, the seasons, or the years, I would, for the sake of sentient beings and out of compassion for them, perform ablutions day and night for seven days, feed on milk and cooked rice, and with great delight in the cultivation of the sublime states recite this teaching of the peaceful core of knowledge without doing anything else.

source: ཉིན་བདུན་པ་ལ་གལ་ཏེ་ཡུལ་ཡོངས་སུ་མ་བསྐྱངས་ན་དེར་ངའི་མདུན་དུ་རང་གི་དམ་བཅས་པས་མི་གནས་པ་ཡིན་ནོ།
en: Had I failed to look after those lands for these seven days, I would not have kept the promise I made to myself.

source: །དེར་ཡང་ངས་རྩི་ལྕམ་པ་སྦྲུལ་གྱི་སྙིང་དང་བཅས་པ་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདིས་བྲམས་ཤིང་སྐྱུགས་སྨན་མ་ད་ནའི་འབྲས་བུ་དག་དང་བསྲེས་ཏེ།
en: In those places, I would infuse with this great teaching of the peaceful core of knowledge an extract of campa herbs combined with uragasāra sandalwood, mix it with an emetic made from the fruits of madana trees, and place it by a temple.

source: ལྷ་རྟེན་སར་བཞག་པས་དེས་དུས་མ་ཡིན་པའི་རླུང་དང་། ཉི་མ་དང་། སྤྲིན་དང་། མུན་པ་དང་། རྡུལ་གྱི་ཆར་པ་དག་དང་། གྲང་བ་དང་། དྲོ་བ་ཐམས་ཅད་ཞི་བར་གྱུར་ཏོ། །ཡང་དག་པའི་དུས་ཚིགས་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། གཟའ་དང་། རྒྱུ་སྐར་དང་། ཟླ་བ་དང་། ཟླ་བ་ཕྱེད་པ་དང་། ལོ་ཡང་དག་པར་བྱུང་བར་གྱུར་ཏོ།
en: That would pacify all instances of untimely wind, sun, untimely clouds, darkness, sandstorms, cold, and heat, and it would cause the seasons, the moon, the sun, the planets, the lunar mansions, the full moon, the half-moon, and the years to occur properly.

source: །རིགས་ཀྱི་བུ་དེས་ན་གང་ན་སེམས་ཅན་དགེ་མཚན་དང་། བཀྲ་ཤིས་དང་། སོ་སོར་ལྡན་པ་དག་དང་། ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་བར་གྱི་སེམས་ཅན་དེ་དག་ལ་ངས་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདིའི་ཆོས་བསྟན་ཏོ།
en: “Noble son, in this way I revealed the Dharma of this great teaching of the peaceful core of knowledge in places where people adhered to signs of auspiciousness and fortune and had wrong views.

source: །གང་དང་གང་དུ་སེམས་ཅན་རྣམས་ཀྱིས་ཐོས་པ་དེ་དང་དེར་ཡང་ཉོན་མོངས་པ་ཆུང་ངུ་དག་ཏུ་གྱུར་ཏོ།
en: Wherever people heard it, their afflictions would diminish.

source: །དགེ་མཚན་དང་། བཀྲ་ཤིས་དང་། ལྟ་བ་ངན་པ་ཐམས་ཅད་སྤངས་ཏེ། དེ་ཕྱིན་ཆད་དགེ་བའི་ལས་དང་ཡང་དག་པར་ལྡན་པ་ལེགས་པར་བྱས་པའི་ལས་ཀྱི་མཐའ་དང་། སྨོན་ལམ་དག་མང་བ་ངེས་པའི་ཕུང་པོ་དག་ཏུ་གྱུར་ཏོ།
en: After renouncing all such signs of auspiciousness, fortune, and wrong views, those beings henceforth formed groups devoted to virtuous deeds and wholesome actions and to numerous aspirations.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ངས་ཐབས་ལ་འཇུག་པའི་སྦྱོར་བ་ལ་བརྟུལ་བ་དེས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་བར་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: “Noble son, similarly, through my commitment to engaging in the application of such skillful means, I ripened sentient beings, made them master the six perfections, and awoke to unsurpassed and perfect buddhahood.

source: །རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་གཅེས་སྤྲས་བྱེད་པ་ཡིན་ནོ། །དེ་ལྟར་ཕན་ཡོན་མང་བ་ཡིན་ཏེ།
en: This great teaching of the peaceful core of knowledge is therefore very helpful and beneficial to sentient beings:

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། བུད་མེད་སྦྲུམ་མ་ཐམས་ཅད་སྲུང་བར་བྱེད་པ། རབ་ཏུ་ཐར་བར་བྱེད་པ།
en: it benefits all of them, it cures all their diseases, and it protects and liberates all pregnant women.

source: ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། ཕུང་པོ་དང་། ཁམས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱེད་པ། ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པར་བྱེད་པ།
en: It pacifies all afflictions, it generates complete knowledge of all the aggregates and elements, and it causes one to discern all phenomena.

source: ཐབས་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པར་བྱེད་པ། བྱང་གྲོལ་གྱི་བདེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྟོགས་པར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དད་པར་བྱེད་པ།
en: It reveals all skillful means, it makes one realize the complete happiness of emancipation, and it induces sincere faith in all sentient beings.

source: ཆོས་ཐམས་ཅད་ཀྱི་བདེ་བ་ལ་འཇུག་པར་བྱེད་པ། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅོད་པར་བྱེད་པ། བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ངེས་པར་འདུལ་བར་བྱེད་པ་ཡིན་ནོ།
en: It causes one to attain happiness related to all phenomena, it eradicates all māras and enemies in accordance with the Dharma, and it thoroughly subjugates all the domains of the māras.

source: །རིགས་ཀྱི་བུ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་བདུད་རྣམས་ཚར་གཅོད་པར་བྱེད་ཅིང་ཉོན་མོངས་པ་རྣམས་ཕམ་པར་བྱེད་པ་ཡིན་ཏེ།
en: Noble son, this great teaching of the peaceful core of knowledge annihilates all māras and vanquishes the afflictions.

source: ལྷ་རྣམས་དགའ་བར་བྱེད་པ། གནོད་སྦྱིན་རྣམས་ཡང་དག་པར་མགུ་བར་བྱེད་པ། ལྷ་མ་ཡིན་རྣམས་རྣམ་པར་འཇོམས་པར་བྱེད་པ། ནམ་མཁའ་ལྡིང་རྣམས་དངང་བར་བྱེད་པ། མི་འམ་ཅི་རྣམས་དད་པར་བྱེད་པ།
en: It pleases the gods, it delights the yakṣas, it overcomes the asuras, it frightens the garuḍas, it generates faith in the kinnaras, and it puts the mahoragas to flight.

source: ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱེད་པ། འཐབ་པ་དང་། འཐབ་མོ་དང་། མུ་གེ་དང་། འཆི་བ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། ནད་ཐམས་ཅད་རྣམ་པར་ཞི་བར་བྱེད་པ།
en: It completely pacifies quarrels, fights, famines, death, diseases, hostile armies, untimely wind, rain, and all types of sicknesses.

source: གྲང་བ་དང་། དྲོ་བ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། རྩུབ་པ་དང་། ཧྲུད་ཧྲུད་པོ་དང་། རེག་པར་དཀའ་བའི་དངོས་པོ་རྣམས་རབ་ཏུ་ཞི་བར་བྱེད་པ།
en: It pacifies cold, heat, snow, and heat waves, and it softens substances that are harsh, rough, and hard to touch.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་འབར་བར་བྱེད་པ། སངས་རྒྱས་ཀྱི་བསྟན་པ་སྟོན་པར་བྱེད་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱེད་པ།
en: It causes the way of the Dharma related to all phenomena to blaze, it reveals the teachings of the buddhas, and it ensures that the lineage of the Three Jewels remains uninterrupted.

source: འཁོར་བས་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བྱེད་པ། ཟད་པ་ཤེས་པ་སྐྱེད་པར་བྱེད་པ། མི་སྐྱེ་བ་ཤེས་པ་རང་གི་མངོན་སུམ་དུ་བྱེད་པ། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇིག་པར་བྱེད་པ། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བྱེད་པ་ཡིན་ནོ།
en: It provides relief to those who are afraid of saṃsāra, it generates knowledge of exhaustion, it actualizes knowledge of the unborn, it overcomes all the dense darkness of ignorance, and it removes the burden of suffering.

source: །རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཡིན་ཏེ།
en: This is the great teaching of the peaceful core of knowledge:

source: ཏད་ཡ་ཐཱ། མ་ནཱ་ཀྵ། ཨ་བཱ་ཀྵ། གྷ་སཱ་ཀྵ། ཛ་ནེ་ཀྵ། མརྨ་ནཱ་ཀྵ། ཀྵ་བཱ་ཀྵ། མ་ཎ་ཌཱ་ཀྵ། ན་ཊཱ་ཀྵ། ན་ད་ར་ཧུ། བི་ས་ནཱ་ད། ཁ་ག་ནཱ་ད། ཨ་ཏ་ན་ཊ། ཀུ་ན་ཊ། པ་རི་ཀུ་ན་ཊ། ནཱ་ཊ་ནཱ་ཊ། པ་རི་ཀ་ནཱ་ཊ། ཨུད་ཏ་ར་ནཱ་ཊ། བི་ནཱ་ཊ། ཀུཉྫ་ནཱ་ཊ། ཙ་བཱཾ་བ་ར་ནཱ་ཊ། ཁ་གྷ་མ་བྷ་ནཱ་ཊ། པུ་ཤྐར་ནཱ་ཊ། སིང་ཧ་རུ་དྲ་ནཱ་ཊ། ས་མ་ལ་ནཱ་ཊ། ཤི་རི་ཀུ་ས་ཀླཽ་ནཱ་ཊ། ཏ་ལ་མ་རུ་ཏ་ཁ་བ། ཏེ་ཧུ་ཀྵ་བ་ཏི་རཀྵ་དཱ་མ་ར་ཛུ་བ་ཧ། ན་པུ་ཏི་ས་ན་ཏི་ར་ན་ཛ་བ། ཨ་མོ་ཧོ་ར་ག་ཛ་ལ། ཨ་ཏྲི་མཱ། ཨ་ཏྲི་ནཱ། ར་བ། ཨ་ཏྲི་ནཱ་ཀྵ། ཨ་བ་ཧཱ། མཱརྒ་ཏྲི་ནཱ་ཀྵ། ཨེ་ཥ་ཨེ་བ་ན་ཏོ་དུཿཁ་སྱ་སྭཱ་ཧཱ།
en: tadyathā: manākṣa avākṣa ghasākṣa janekṣa marmanākṣa kṣavākṣa maṇḍākṣa naṭākṣa nadarahu visanāda khaganāda atanaṭa kunaṭa parikunaṭa nāṭanāṭa parikanāṭa udtaranāṭa vināṭa kuñjanāṭa cavaṃvaranāṭa khaghamabhanāṭa puśkaranāṭa siṅharudranāṭa samalanāṭa śirikusaklaunāṭa talamarutakhava tehukṣavatirakṣadāmarajuvaha naputisantiranajava amohoragajala atrinā atrinā rava atrinākṣa avahā mārgatrinākṣa eṣa evantoduḥkhasya svāhā.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་འདི་བསྟན་པ་ན་འཁོར་དེར་སྲོག་ཆགས་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །དཀྲིགས་པ་ཕྲག་དྲུག་ཅུ་དག་ཀྱང་སྐྱོན་མེད་པ་ལ་ཞུགས་པར་གྱུར་ཏོ།
en: When the Blessed One delivered this teaching, six hundred million beings in that retinue achieved the concordant acceptance, and sixty trillion of them entered into faultlessness.

source: །རིགས་ཀྱི་བུ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ངས་ཁྱོད་ཀྱི་ལག་ནས་བསྐུར་ཏོ།
en: “Noble son, through you I will confer this great teaching of the peaceful core of knowledge upon the thus-gone Śākyamuni.

source: །དེར་ཡང་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་ལ་ང་དད་པ་སྦྱིན་པར་མཛད་དོ།
en: I will also bestow faith in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: །རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་འདི་ལོང་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་སོང་ཤིག །ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་གནོད་པ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་ཀྱང་ཞུས་ཤིག །
en: Take this peaceful core of knowledge with you, and go to that buddha realm of Sahā! Present my words to the thus-gone Śākyamuni, and ask him if he has any ills or problems and whether he is healthy and well.

source: འདི་སྐད་དུ་བྱང་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བརྒྱད་ཅུའི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པ་སྒྲ་ཐམས་ཅད་ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བ་ཡོད་དེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: Tell him, ‘In the northern direction, beyond buddha realms as numerous as the grains of sand in eighty Ganges Rivers, there is a buddha realm ripe with the five degenerations called Manifestation of All Sounds, where the thus-gone, worthy, perfect Buddha Glorious Essence of Flowers resides and teaches the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཡོངས་སུ་ཞུ་བའི་སླད་དུ་བདག་མངགས་པ་ལགས་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་བསྙུང་བ་མི་མངའ་ལགས་སམ། གནོད་པ་ཆུང་ལགས་སམ།
en: That thus-gone one has sent me here from that buddha realm to ask these questions to the Blessed One: “Respected Blessed One, are you well and free from ills?

source: ཁྱོད་ཀྱི་འཁོར་བྲོ་འཚལ་བ་དག་མ་མཆིས་ལགས་སམ། གནོད་པ་དག་ཆུང་ལགས་སམ།
en: Are the members of your retinue comfortable and in good health?

source: ཇི་ལྟར་ཆོས་ཐོས་པ་བཞིན་དུ་ཆོས་དེ་ལ་ནན་ཏན་སྙིང་པོར་བགྱིད་པ་དག་ལགས་སམ།
en: Do they apply the Dharma persistently in the way they hear it?

source: ཆོས་ཀྱིས་གནས་པ་དག་གིས་གནས་པར་བགྱིད་པ་ལགས་སམ།
en: Do they abide by the Dharma?

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་བདུད་ཀྱི་ཡུལ་དང་། ཀླུའི་ཡུལ་བཅོམ་ལགས་སམ།
en: Are the domains of the māras and the nāgas subjugated in your buddha realm?

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཡུལ་གཅིག་པུ་ལགས་སམ།
en: Is this your only buddha realm?

source: འདི་ན་ཐོགས་པ་མ་མཆིས་པར་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ལགས་སམ། གང་སུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འཁོར་ལོ་བསྐོར་བར་མཛད་པ་དེ་དག་གི་ཆེད་དུ་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེས་འདིར་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་འབྱང་བའི་གཟུངས་སྔགས་ལ་དད་པ་སྩོལ་བར་མཛད་ཅིང་དེ་ནས་རིག་པ་ཆེན་པོ་ཡོད་པའི་སྦུ་བས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་མཐུ་ཆེ་བ།
en: Are you turning the Dharma wheel without obstruction in this place?” For the sake of those who will turn the wheel in this buddha realm, the thus-gone Glorious Essence of Flowers will, in this place, bestow faith in the practice of the Dharma of The Quintessence of the Sun, this section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that cleanses the karmic actions of sentient beings.

source: ཕན་ཡོན་ཆེ་བ་འདི་བསྐུར་ལགས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བགྱིད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ་ཞེས་བྱ་བ་ནས། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བགྱིད་པ་ཞེས་བྱ་བའི་བར་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་བསྐུར་ལགས་སོ་ཞེས་ཀྱང་གསོལ་ཅིག །
en: He bestows this powerful and beneficial great teaching of the peaceful core of knowledge, which benefits all beings, cures all diseases, pacifies all afflictions, [. . .] and removes the burden of suffering.’ ”

source: དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་ཐོབ་ཅིང་རྨད་དུ་བྱུང་བ་ཐོབ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that moment, the entire retinue exclaimed, amazed and astonished,

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་དང་གཟིགས་པ་ནི་ངོ་མཚར་ཏོ། །མཆོག་ཏུ་ངོ་མཚར་ཏོ། །
en: “The blessed buddhas’ wisdom and vision, which are unimpeded with respect to all phenomena, are amazing! They are truly amazing!

source: དེ་ལྟ་ལགས་པས་ད་ལྟར་དེ་བཞིན་གཤེགས་པས་བདག་ཅག་ལ་མངོན་མ་ཐོས་པ་འདི་ལྟར་ཟབ་པའི་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པ་འདི་ཁོ་ན་བསྟན་ཏོ།
en: The Thus-Gone One has now revealed to us nothing but this great teaching of the peaceful core of knowledge, which benefits all beings and has never been heard before.

source: །གང་ལ་ཡོན་ཏན་འདི་ལྟ་བུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དེ་དག་མཆིས་པ་འདི་ལ་མཁས་པ་བྱང་ཆུབ་ཚོལ་བར་བྱེད་པ་སུ་ཞིག་མངོན་པར་བརྩོན་པར་མི་བགྱིད།
en: What wise being in pursuit of awakening would not strive for something endowed with such countless and limitless qualities?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སེམས་ཅན་གང་སུ་དག་འཁོར་བས་སྐྲག་ཅིང་བྱང་གྲོལ་གྱི་བདེ་བ་མངོན་པར་འཚལ་བ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་མཚན་ཡོངས་སུ་བསྒྲགས་པ་དང་རིག་པ་མཆིས་པའི་སྦུབས་ཞི་བའི་གཟུངས་སྔགས་ཀྱི་མིང་ཡོངས་སུ་བསྒྲགས་པ་ན་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། གུས་པར་སེམས་ཅན་རྣམས་ཀྱི་རྙེད་པ་ཆེན་པོ་དང་། དགེ་བའི་ཕྱོགས་རྣམ་པར་འཕེལ་བར་འགྱུར་ལགས་སོ།
en: Then, the bodhisattva Ākāśagarbha said, “When the sentient beings who are afraid of saṃsāra and pursue the happiness of emancipation proclaim the names of the Blessed One and the words of this dhāraṇī mantra peaceful core of knowledge, the great attainments and virtues of sentient beings will greatly increase in them, along with feelings of joy, delight, and respect.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ།
en: The thus-gone Glorious Essence of Flowers replied, “Thus it is, noble son!

source: །ཁྱོད་ཀྱིས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: It is just as you have said!

source: རིགས་ཀྱི་བུ་ང་བྱང་ཆུབ་སེམས་དཔའ་གྱུར་ཏེ་བརྩོན་པ་འདིས་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་འདི་ལྟ་བུ་བཏབ་བོ།
en: Noble son, when I was a bodhisattva and practiced the conduct with diligence, I made these aspirations:

source: །བདག་བྱང་ཆུབ་ཐོབ་ནས་སེམས་ཅན་གང་སུ་དག་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་སྦྱིན་པ་ལ་བརྩོན་པའི་བསམ་པ་ཅན་ཞེས་བྱ་བ་ནས། ཤེས་རབ་ལ་བརྩོན་པའི་བསམ་པ་ཅན་ཞེས་བྱ་བའི་བར་དག་གིས་བདག་གི་མིང་སྒྲོགས་པར་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སེམས་པར་བྱེད་ན་གལ་ཏེ་དེ་དག་ལ་ལྷ་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ན་སེམས་ཅན་ལ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་དང་དེ་དག་གི་བར་ཆད་བྱེད་པར་ནུས་པ་ཞིག་ཡོད་ན་སེམས་ཅན་དེ་དག་གི་དགེ་བའི་ཕྱོགས་འཕེལ་བ་བརྒྱ་སྟོང་དུ་མར་གྱུར་ཅིག །སྔོན་གྱི་ལས་ཀྱི་འབྲས་བུའི་རྒྱུ་ནི་མ་གཏོགས་སོ།
en: ‘Once I achieve awakening, if, in all the buddha realms of the ten directions, sentient beings who have the wish to strive for the perfections—from generosity up to insight— proclaim my name and cause sentient beings to contemplate it, then, if there are any beings in the world with its gods and asuras who have the ability to create obstacles to their practice of those perfections, may the virtuous side of those beings—all but the causes that are results of their previous actions—multiply many hundreds of thousands of times!

source: །བདག་ཀྱང་རེ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །གང་ཡང་བུད་མེད་བུ་ལ་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་ནས། བུའི་ཁུར་གྱིས་སྐྱོ་བ་ཞེས་བྱ་བའི་བར་དང་། གང་བུད་མེད་སྦྲུམ་པ་ཞེས་བྱ་བའི་བར་བདག་ལ་ཕྱག་འཚལ་བར་བྱེད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དགའ་བ་དང་། གུས་པ་དང་། དད་པས་བདག་གི་མིང་ཡོངས་སུ་སྒྲོགས་པར་བྱེད་ལ།
en: May I postpone my awakening to unsurpassed and perfect buddhahood in order to help those mothers who experience great joy with their children, those who are weary of the burden of having children, and those pregnant women who pay homage to me, as well as anyone who proclaims my name with joy, respect, and faith.

source: གལ་ཏེ་མའམ་མངལ་ན་ཡོད་པ་དེ་ལ་མིའམ་མི་མ་ཡིན་པ་སྡང་བའི་སེམས་ཀྱིས་རྣམ་པར་ཐོ་འཚམ་པར་བྱེད་དམ། སྨན་དང་། གསང་སྔགས་ཀྱི་སྦྱོར་བས་ཀྱང་རུང་སྟེ། ལུས་ཀུན་ཏུ་འཁྲུག་པར་བྱེད་དམ། སེམས་ཀུན་ཏུ་འཁྲུག་པར་བྱེད་དམ་ཞེས་བྱ་བ་ནས་བཙས་པ་ཙམ་གྱི་བར་ལ་ཡང་ཐ་ན་ཡུད་ཙམ་གཅིག་ཙམ་ཡང་རྣམ་པར་ཐོ་འཚམ་པར་བྱེད་ན། བདག་རེ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག་ཅེས་སྔོན་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པའི་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་བོ།
en: May I postpone my awakening to unsurpassed and perfect buddhahood in order to help should any human or nonhuman being filled with hostility use medicines or mantras to hurt or disturb the bodies and minds of such mothers and the children they carry in their wombs, or should they for a single instant hurt a newborn baby!’ Those are the aspirations I made in the past when I was a bodhisattva.

source: །དེ་བཞིན་དུ་ད་ལྟར་ཡང་སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་སྡུག་བསྔལ་དེ་ལྟ་བུས་གཟིར་བ་དག་ཀྱང་ཞེས་བྱ་བ་ནས། ཇི་ལྟར་སྔར་བསྟན་པ་བཞིན་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དགའ་བ་དང་། གུས་པ་དང་། དང་བས་བདག་གི་མིང་ཡོངས་སུ་སྒྲོགས་པར་བྱེད་པ་ཐམས་ཅད་སྡུག་བསྔལ་དེ་དག་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་ཏེ་གཞན་དུ་མ་ཡིན་ནོ།
en: In accordance with those, anyone who is now tormented by such sufferings in any buddha realm and—as it was explained before—anyone who proclaims my name with joy, respect, and faith will be liberated from their sufferings.

source: །སྦྱངས་པ་མ་ཡིན་ན་སྔོན་གྱི་ལས་ཀྱི་འབྲས་བུའི་རྒྱུ་ནི་མ་གཏོགས་སོ།། །།
en: It will not be any other way—except when it comes to causes that are results of their previous actions, if these are not purified.”

source: དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ནི་ངོ་མཚར་ལགས་ཏེ།
en: The bodhisattva said, “Respected Blessed One, that buddha realm of Sahā is strange:

source: དེ་ན་སེམས་ཅན་རྣམས་མཆོག་ཏུ་སྡང་བ། གཟུ་ལུམས་ཅན། རྩུབ་པ། ཕྲག་དོག་དང་ལྡན་པ།
en: in that place, sentient beings are extremely hostile, impetuous, harsh, and envious.

source: སྙིང་བརྩེ་བ་མ་མཆིས་པ། བགྱིས་པ་མི་གཟོ་བ། ཚིག་རྩུབ་པོར་སྨྲ་བ། ལོག་པར་ལྟ་བ་དག་ལགས་པས་དེར་ཁ་ཅིག་གིས་བདག་ལ་རྣམ་པར་ཐོ་བཙམས་ན་མི་རུང་སྟེ།
en: They lack affection and gratitude, they speak with harsh words, and they adhere to wrong views. So it would not be good if I were hurt there by some of those beings.

source: བདག་མཆིས་པས་ཅི་ལ་ཡང་མི་སྨན་ལགས་སོ།
en: I would not benefit anyone by going there!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདི་ནི་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དོ།
en: “Noble son,” replied the Blessed One, “it is impossible. There is no chance for this to happen!

source: །སུས་དམིགས་པ་མེད་པའི་ཚངས་པའི་གནས་པ་ལེགས་པར་བསྒོམས་ཤིང་ལེགས་པར་ཡིད་ལ་བྱས་པར་གྱུར་པ་དེ་ལ་ནི་བདུད་བྱེ་བས་ཀྱང་རྣམ་པར་ཐོ་འཚམ་པའམ།
en: Not even ten million māras could hurt or create obstacles to those who have properly cultivated and contemplated the sublime states free from concepts;

source: བར་ཆད་བྱེད་པར་ནུས་པ་འདི་ནི་གནས་མེད་དོ།
en: it would be impossible!

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཡུན་རིང་པོ་ནས་དམིགས་པ་མེད་པའི་ཚངས་པའི་གནས་པ་ཤིན་ཏུ་བསྒོམས་ཤིང་ལེགས་པར་ཡིད་ལ་བྱས་ཟིན་གྱིས་མ་འཇིགས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ལ་གསང་སྔགས་གང་དག་གིས་སྡང་བ་ཐམས་ཅད་དད་པར་འགྱུར་བ་དང་། རྨོངས་པར་འགྱུར་བ་དང་། གང་གིས་བཟོད་པ་དང་། དྲན་པ་དང་། རབ་ཏུ་དང་བ་ཐོབ་པར་བྱེད་པའི་གཟུངས་སྔགས་དམིགས་པ་མེད་པའི་ཚངས་པའི་གནས་པའི་རྒྱུ་འཐུན་པ་བྱམས་པ་ཆེན་པོ་སྦྱིན་པར་མཛད་དོ། །
en: Noble son, you have already properly cultivated and contemplated the sublime states free from concepts for a long time, so do not be afraid! Noble son, I will confer upon you a dhāraṇī mantra of great love that emerges from the sublime states free from concepts. Through this mantra, all hostile beings will develop trust and become stupefied; it will cause them to achieve acceptance, recollection, and sincere faith.

source: ཏད་ཡ་ཐཱ། བོ་བྲི་ཧ། བུ་བུ་ལ། ཨི་ལ་བ་ར། ཨི་ལ་ས་ཧ། ཧ་ཊྱ་ཊྱ་ག་ག་ནཱ་ཀྵ། ཤ་མ་ཤ་མ། མི་ཏྲ་མི་ཏྲ། ཙཀྲ་བར་ཏི་ཏི་ལེ། སཱ་ག་ར་ཏི་ལེ། དུརྦྷ་ལི། ཧི་ཧི་ལེ། ཧ་བ་ཧེ་ན་རཱ་ཛ་ནེ། ཡ་བ་ན་མི་ཏྲེ། ཀྵཱ་ན་ཏི་མི་ཏྲེ། མི་ཏྲ་རླ་མེ། མི་ཏྲ་ཁ་གྷ། སརྦ་ས་ཏོ་ཛ་མི་ཏྲེ། སརྦ་ཀྲ་མ་མི་ཏྲེ། མ་ན་བརྟ་མི་ཏྲེ། དྷི་ཏི་ཤ་ར་མི་ཏྲེ་སྭཱ་ཧཱ།
en: tadyathā: vovriha vuvula ilavara ilasaha haṭyaṭyagaganākṣa śamaśama mitramitra cakravartitile sāgaratile durbhali hihile havahenarājane yavanamitre kṣānatimitre mitrarlame mitrakhaghe sarvasatojamitre sarvakramamitre manavartamitre dhitiśaramitre svāhā.

source: རིགས་ཀྱི་བུ་སྡང་བ་ཞི་བར་བྱེད་པ་དང་། རྨོངས་པར་བྱེད་པའི་གསང་སྔགས་ཀྱི་གཟུངས་སྔགས་འདིས་ཙམ་པ་ཀའི་འབྲུ་མར་ལ་ལན་བདུན་བཟླས་བརྗོད་བྱས་པས་ལག་པ་གཉིས་བསྐུས་ན་སྡང་བ་ཐམས་ཅད་དད་པར་བྱེད།
en: “Noble son, if one rubs both hands with oil from campaka grains while reciting this secret dhāraṇī mantra that pacifies and stupefies hostile beings, it will make all hostile beings trusting and astonished.

source: རྨོངས་པར་བྱེད་ཅིང་སྡང་བའི་སྦྲུལ་དག་དང་། སྡང་བའི་གནོད་སྦྱིན་དང་། གྲུལ་བུམ་དང་། སྲུལ་པོ་དང་། བདུད་བྱེ་བ་བརྒྱ་སྟོང་ཡང་རུང་སྟེ། སྡང་བའི་སེམས་དང་ལྡན་པའི་སེམས་ཅན་དེ་དག་གིས་ཅི་ཡང་བྱེད་པར་མི་ནུས་སོ།
en: All those beings with hostile minds, such as the trillions of angry snakes, yakṣas, kumbhāṇḍas, pūtanas, and māras, will become powerless.
